Управление_по_целям_и_KPI/src/Reports/KPI_РасчетныйЛисток/KPI_РасчетныйЛисток.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>KPI_РасчетныйЛисток</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектУправления</name>
    <type>
      <types>CatalogRef.KPI_Сотрудники</types>
    </type>
  </attributes>
</mdclass:Report>

Управление_по_целям_и_KPI/src/Enums/KPI_ПериодичностьПланирования/KPI_ПериодичностьПланирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>KPI_ПериодичностьПланирования</name>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>Квартал</name>
  </enumValues>
  <enumValues>
    <name>Полугодие</name>
  </enumValues>
  <enumValues>
    <name>Год</name>
  </enumValues>
</mdclass:Enum>

Управление_по_целям_и_KPI/src/Reports/KPI_РасчетныйЛисток/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДокументРезультат.Очистить();

	ПараметрыДанных   = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	Период            = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период")).Значение;
	ГраницыПериода    = KPI_ОбщегоНазначенияСервер.ГраницыПериода(период,Перечисления.KPI_ПериодичностьПланирования.Месяц);
	СтруктураКомпании = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ОбъектУправления")).Значение;
	Сотрудник = KPI_ОбщегоНазначенияСервер.ПолучитьСотрудникаПоСтруктуреКомпанииНаДату(СтруктураКомпании,Период);
	
	ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода" , ГраницыПериода.НачалоПериода);
	ПараметрыДанных.УстановитьЗначениеПараметра("КонецПериода"  , ГраницыПериода.КонецПериода);
	ПараметрыДанных.УстановитьЗначениеПараметра("Сотрудник"     , Сотрудник);
	
	Компоновщик     = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = Компоновщик.Выполнить(СхемаКомпоновкиДанных,КомпоновщикНастроек.Настройки,ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,,ДанныеРасшифровки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;	
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры
